ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/scb/cy_scb_ezi2c.c
/***************************************************************************//**
* \file cy_scb_ezi2c.c
* \version 1.0
*
* Provides EZI2C API implementation of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_scb_ezi2c.h"

#if defined(__cplusplus)
extern "C" {
#endif


/***************************************
*        Function Prototypes
***************************************/

static void HandleErrors      (CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context);
static void HandleAddress     (CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context);
static void UpdateRxFifoLevel (CySCB_Type *base, uint32_t bufSize);
static void HandleDataReceive (CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context);
static void HandleDataTransmit(CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context);
static void HandleStop        (CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context);
static void UpdateAddressMask (CySCB_Type *base, cy_stc_scb_ezi2c_context_t const *context);


/*******************************************************************************
* Function Name: Cy_SCB_EZI2C_Init
****************************************************************************//**
*
* Initializes the SCB for the EZI2C operation.
*
* \param base
* The pointer to the EZI2C SCB instance.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_scb_ezi2c_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_ezi2c_context_t
* allocated by the user. The structure is used during the EZI2C operation for
* internal configuration and data keeping. The user should not modify anything
* in this structure.
*
* \return
* \ref cy_en_scb_ezi2c_status_t
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
*******************************************************************************/
cy_en_scb_ezi2c_status_t Cy_SCB_EZI2C_Init(CySCB_Type *base, cy_stc_scb_ezi2c_config_t const *config,
                                           cy_stc_scb_ezi2c_context_t *context)
{
    cy_en_scb_ezi2c_status_t retStatus = CY_SCB_EZI2C_BAD_PARAM;

    if ((NULL != base) && (NULL != config) && (NULL != context))
    {
        /* Configure the EZI2C interface */
        base->CTRL = ((config->numberOfAddresses == CY_SCB_EZI2C_TWO_ADDRESSES) ? SCB_CTRL_ADDR_ACCEPT_Msk : 0UL) |
                      (config->enableWakeFromSleep ? SCB_CTRL_EC_AM_MODE_Msk  : 0UL) |
                       SCB_CTRL_BYTE_MODE_Msk;

        base->I2C_CTRL = CY_SCB_EZI2C_I2C_CTRL;

        /* Configure the RX direction */
        base->RX_CTRL      = CY_SCB_EZI2C_RX_CTRL;
        base->RX_FIFO_CTRL = 0UL;

        /* Set the default address and mask */
        if (config->numberOfAddresses == CY_SCB_EZI2C_ONE_ADDRESS)
        {
            context->address2 = 0U;
            Cy_SCB_EZI2C_SetAddress1(base, config->slaveAddress1, context);
        }
        else
        {
            Cy_SCB_EZI2C_SetAddress1(base, config->slaveAddress1, context);
            Cy_SCB_EZI2C_SetAddress2(base, config->slaveAddress2, context);
        }

        /* Configure the TX direction */
        base->TX_CTRL      = CY_SCB_EZI2C_TX_CTRL;
        base->TX_FIFO_CTRL = CY_SCB_EZI2C_HALF_FIFO_SIZE;

        /* Configure interrupt sources */
        base->INTR_SPI_EC_MASK = 0UL;
        base->INTR_I2C_EC_MASK = 0UL;
        base->INTR_RX_MASK     = 0UL;
        base->INTR_TX_MASK     = 0UL;
        base->INTR_M_MASK      = 0UL;
        base->INTR_S_MASK      = CY_SCB_EZI2C_SLAVE_INTR;

        /* Initialize context */
        context->status = 0UL;
        context->state  = CY_SCB_EZI2C_STATE_IDLE;

        context->subAddrSize = config->subAddressSize;

        context->buf1Size      = 0UL;
        context->buf1rwBondary = 0UL;
        context->baseAddr1     = 0UL;

        context->buf1Size      = 0UL;
        context->buf1rwBondary = 0UL;
        context->baseAddr2     = 0UL;

        retStatus = CY_SCB_EZI2C_SUCCESS;
    }

    return (retStatus);
}


/*******************************************************************************
*  Function Name: Cy_SCB_EZI2C_DeInit
****************************************************************************//**
*
* De-initializes the SCB block, returns register values to default.
*
* \param base
* The pointer to the EZI2C SCB instance.
*
* \note
* Ensure that the SCB block is disabled before calling this function.
*
*******************************************************************************/
void Cy_SCB_EZI2C_DeInit(CySCB_Type *base)
{
    /* Returns block registers into the default state */
    base->CTRL     = CY_SCB_CTRL_DEF_VAL;
    base->I2C_CTRL = CY_SCB_I2C_CTRL_DEF_VAL;

    base->RX_CTRL      = CY_SCB_RX_CTRL_DEF_VAL;
    base->RX_FIFO_CTRL = 0UL;
    base->RX_MATCH     = 0UL;

    base->TX_CTRL      = CY_SCB_TX_CTRL_DEF_VAL;
    base->TX_FIFO_CTRL = 0UL;

    base->INTR_SPI_EC_MASK = 0UL;
    base->INTR_I2C_EC_MASK = 0UL;
    base->INTR_RX_MASK     = 0UL;
    base->INTR_TX_MASK     = 0UL;
    base->INTR_M_MASK      = 0UL;
    base->INTR_S_MASK      = 0UL;
}


/*******************************************************************************
* Function Name: Cy_SCB_EZI2C_Disable
****************************************************************************//**
*
* Disables the SCB block and clears context statuses.
* Note that after the block was disabled, the TX and RX FIFOs and hardware
* statuses are cleared. Also, the hardware stops driving the output and
* ignores the input.
*
* \param base
* The pointer to the EZI2C SCB instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_scb_ezi2c_context_t
* allocated by the user. The structure is used during the EZI2C operation for
* internal configuration and data keeping. The user should not modify anything
* in this structure.
*
* \note
* Calling this function when EZI2C is busy (slave was address and communicates
* with master) may cause transaction corruption because the hardware stops
* driving the output and ignores the input. It is recommenced to ensure that
* EZI2C slave is not busy before calling this function.
*
*******************************************************************************/
void Cy_SCB_EZI2C_Disable(CySCB_Type *base, cy_stc_scb_ezi2c_context_t *context)
{
    base->CTRL &= (uint32_t) ~SCB_CTRL_ENABLED_Msk;

    /* Set the state to default and clear statuses */
    context->status = 0UL;
    context->state  = CY_SCB_EZI2C_STATE_IDLE;
}


